Autodesk.Revit.DB.ParameterUtils.DownloadCompanyName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ForgeTypeId,System.String)
Downloads the name of the given parameter's owning account and records it in the given document. If the owning
account's name is already recorded in the given document, this method returns the name without downloading it
again.
Remarks:
In Revit, the account name appears in the parameter tooltip if available.
document:
Document in which to record the name of the parameter's owning account.
parameterTypeId:
Parameter identifier.
region:
Region of the account where the parameter is defined.
Returns:
Name of the owning account.
Throws Autodesk.Revit.Exceptions.AccessDeniedException:
Thrown when the user is not authorized to access the requested information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region is not valid.
-or-
Thrown when the parameter identifier does not include an account identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk::Revit::Exceptions::NetworkCommunicationError:
Thrown when communication with the remote service is unsuccessful.
Throws Autodesk.Revit.Exceptions.ResourceNotFoundException:
Thrown when the requested information is not found.
Throws Autodesk.Revit.Exceptions.ServerInternalException:
Thrown when the remote service reports an internal error.
Throws Autodesk.Revit.Exceptions.UnauthenticatedException:
Thrown when the user is not signed in.
Since:
2024.3.5

Autodesk.Revit.DB.ParameterUtils.DownloadParameterOptions(Autodesk.Revit.DB.ForgeTypeId,System.String)
Retrieves settings associated with the given parameter from the Parameters Service.
Remarks:
The settings associated with a parameter definition are accessible only to an authorized user.
To retrieve them, the user must be signed in.
parameterTypeId:
Parameter identifier.
region:
Region of the account where the parameter is defined.
Returns:
Settings associated with a parameter.
Throws Autodesk.Revit.Exceptions.AccessDeniedException:
Thrown when the user is not authorized to access the requested information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region is not valid.
-or-
Thrown when the given parameter identifier is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk::Revit::Exceptions::NetworkCommunicationError:
Thrown when communication with the Parameters Service is unsuccessful.
Throws Autodesk.Revit.Exceptions.ResourceNotFoundException:
Thrown when the requested parameter is not found.
Throws Autodesk.Revit.Exceptions.ServerInternalException:
Thrown when the Parameters Service reports an internal error.
Throws Autodesk.Revit.Exceptions.UnauthenticatedException:
Thrown when the user is not signed in.
Since:
2024.3.5

Autodesk.Revit.DB.ParameterUtils.DownloadParameter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ParameterDownloadOptions,Autodesk.Revit.DB.ForgeTypeId,System.String)
Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service.
Remarks:
The identifier of a user-defined parameter definition on the Parameters Service has the form
"parameters.<accountId>:<schemaId>-<versionNumber>", where <versionNumber> is a
semantic version number such as "1.0.0" and <accountId> and <schemaId> are GUIDs consisting of
32 hexadecimal digits. Revit will extract the <schemaId> GUID to identify the shared parameter
element.
If a shared parameter with a matching GUID is not yet present in the document, this method will attempt
to obtain the parameter and apply the given bindings. If the parameter definition is already available
locally, Revit will use the local definition. Otherwise, Revit will attempt to download the requested
parameter definition from the Parameters Service.
The given document may be either a project or a family document. The rules for adding parameters to
project and family documents differ.
For family documents, requesting a parameter with a GUID matching that of a shared parameter already
present in the family document is an error.
Family parameters must have unique names. There is an error if the target document is a family and the
downloaded parameter is found to have a name that matches that of a parameter already present in the family
document.
Family parameters must be initialized to a default value. There is an error if the target document is a
family and the downloaded parameter is a Family Type parameter and no family of the requisite category
exists in the family document.
When the target document is a project, if a parameter exactly matching the given ForgeTypeId is already
present in the document, this method will not download anything. Otherwise, if a local shared parameter with
a GUID colliding with the given ForgeTypeId is already present in the project document, this method will
download the requested parameter from the Parameters Service, validate that the requested parameter is
compatible with the existing local definition, and overwrite the existing local definition according to the
downloaded definition. Attempting to download an incompatible definition that collides with an existing
local shared parameter is an error. If the parameter or a compatible local parameter is already present in
the target project document, this method will update the existing parameter's bindings according to the
given bindings. When updating bindings, new category bindings may be added to the existing parameter but
existing category bindings will not be removed.
document:
Document in which to create a shared parameter from a downloaded definition.
options:
Parameter download options.
parameterTypeId:
Parameter identifier.
region:
Region of the account where the parameter is defined.
Returns:
The shared parameter instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region is not valid.
-or-
Thrown when the parameter identifier does not include a GUID, when required bindings are not assigned, when
the requested group identifier does not identify a group that accommodates user-defined parameters, when a
parameter with a matching GUID is already present in the given family document, when the given project
document already contains an incompatible parameter definition with the same GUID, or when a parameter with
a matching name is already present in the given family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DefaultValueException:
Thrown when the target document is a family and the downloaded parameter is a Family Type parameter and no
family of the requisite category exists in the family document.
Throws Autodesk.Revit.Exceptions.NetworkCommunicationException:
Thrown when communication with the Parameters Service is unsuccessful.
Throws Autodesk.Revit.Exceptions.ResourceNotFoundException:
Thrown when the requested parameter definition is not found on the Parameters Service.
Throws Autodesk.Revit.Exceptions.SchemaException:
Thrown when there is an error interpreting a downloaded parameter definition.
Since:
2024.3.5

Autodesk.Revit.DB.ParameterUtils.IsValidRegionCode(System.String)
Checks whether a given region code is allowed to identify a region where an account containing parameter
definitions may exist.
Remarks:
In order to support new regions in the future, this method does not use a fixed list.
Supported regions include "US", "EMEA", "IRL", "APAC", "AUS", "GBR", "DEU", "JPN", "CAN", and "IND".
A return value of true does not indicate that a given region actually exists.
region:
The region to check.
Returns:
False if the region is invalid, true otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.3.5